<template>
  <q-page padding>
    <editor :text="text" :layers="layers" />
  </q-page>
</template>

<script>
import Editor from "components/Editor/Editor";

export default {
  data() {
    return {
      text:
        "༄། །འབྲི་གུང་ཚོགས་ཆོས་ཆེན་མོ།" +
        "༼ཚོགས་ཆོས་ཀྱི་རིམ་པ་ལེགས་པར་བཤད་པ་ཡིད་བཞིན་ནོར་བུ་ཞེས་བྱ་བ་བཞུགས་སོ།།༽" +
        "ཚོགས་གཉིས་མཐར་ཕྱིན་མཚན་དང་དཔེ་བྱད་རིན་ཆེན་རི་བོ་ལྟར་མཛེས་སྐུ་ཡི་དཀྱིལ་འཁོར་བསམ་གྱིས་མི་ཁྱབ་མཁའ་མཉམ་སེམས་ཅན་ཁམས་དང་མཉམ་པར་འཇུག །ཆོས་རྣམས་གདོད་ནས་མ་སྐྱེས་སྟོང་པར་སྟོན་པའི་གསུང་གི་དཀྱིལ་འཁོར་བསམ་གྱིས་མི་ཁྱབ་ཐེ་ཚོམ་གཅོད་ཅིང་སེམས་ཅན་རྣམས་ཀྱི་སྐད་དང་མཐུན་པར་འཇུག །དུས་གསུམ་འགྱུར་མེད་འོད་གསལ་སྒྲིབ་གསུམ་རབ་སྤངས་རྣམ་དག་ཐུགས་ཀྱི་དཀྱིལ་འཁོར་བསམ་གྱིས་མི་ཁྱབ་ཡེ་ཤེས་དུས་རྣམས་ཀུན་ལ་ཆགས་ཐོགས་མེད་པར་འཇུག །ཡོན་ཏན་རྒྱ་མཚོ་སྐུ་གསུང་ཐུགས་དང་མཛད་པ་འཕྲིན་ལས་ལྷུན་གྲུབ་བསམ་གྱིས་མི་ཁྱབ་བློ་ལས་རྣམ་འདས་འགྲོ་བའི་དཔལ་གྱུར་ཆོས་ཀྱི་རྗེ་ལ་འདུད། །",
      layers: [
        {
          id: 1,
          name: "Book Title",
          style: "book-title",
        },
        {
          id: 2,
          name: "Author",
          style: "author",
        },
        {
          id: 3,
          name: "Chapter",
          style: "chapter",
        },
        {
          id: 4,
          name: "Citation",
          style: "citation",
        },
      ],
    };
  },

  components: {
    Editor,
  },
};
</script>